{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of2", "group3-shard2of2"], "weights": [{"name": "dense_1/kernel", "shape": [9216, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss_weights": null, "loss": "categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "amsgrad": false, "decay": 0.0}}}, "keras_version": "2.1.3", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "name": "conv2d_1", "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "activity_regularizer": null, "units": 128, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_2", "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}}}