{"modelTopology": {"keras_version": "2.0.8", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_1", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_2", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_3", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_4", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}, "name": "leaky_re_lu_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_5", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}, "name": "leaky_re_lu_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_6", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_6"}, "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_7"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_7", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_7"}, "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_8"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_8", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_8"}, "name": "leaky_re_lu_8"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_9"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_9", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_9"}, "name": "leaky_re_lu_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_10"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_10", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_10"}, "name": "leaky_re_lu_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_11"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_11", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_11"}, "name": "leaky_re_lu_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_12"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_12", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_12"}, "name": "leaky_re_lu_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_13", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_13", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_13"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_13", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_13"}, "name": "leaky_re_lu_13"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_14", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_14"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_14", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_14"}, "name": "leaky_re_lu_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_15", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_15"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_15", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_15"}, "name": "leaky_re_lu_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_16", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_16"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_16", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_16"}, "name": "leaky_re_lu_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_17", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_17", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_17"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_17", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_17"}, "name": "leaky_re_lu_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_18", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_18", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_18"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_18", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_18"}, "name": "leaky_re_lu_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_19", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_19", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv_21"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_19", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_19"}, "name": "leaky_re_lu_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_21", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_21", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_20"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_21", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_21"}, "name": "leaky_re_lu_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_20", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_20", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_20"}, {"class_name": "Lambda", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\n\u0000\u0000\u0000block_sizei\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0002\u0000\u0000\u0000tft\u000e\u0000\u0000\u0000space_to_depth(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s-\u0000\u0000\u0000/home/andy/github/basic-yolo-keras/backend.pyt\u0011\u0000\u0000\u0000space_to_depth_x2&\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "name": "lambda_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_20", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_20"}, "name": "leaky_re_lu_20"}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda_1", 0, 0, {}], ["leaky_re_lu_20", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_22", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "norm_22", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "norm_22"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["norm_22", 0, 0, {}]]], "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_22"}, "name": "leaky_re_lu_22"}], "input_layers": [["input_3", 0, 0]], "name": "model_1", "output_layers": [["leaky_re_lu_22", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "model_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "conv_23", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 30, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "conv_23"}, {"class_name": "Reshape", "config": {"target_shape": [13, 13, 5, 6], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["conv_23", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 1, 1, 10, 4], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S(\u0002\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000args(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s.\u0000\u0000\u0000/home/andy/github/basic-yolo-keras/frontend.pyt\b\u0000\u0000\u0000<lambda>@\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "name": "lambda_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_2", 0, 0]], "name": "model_2"}}, "training_config": {"metrics": null, "loss": "custom_loss", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 9.999999747378752e-05, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv_23/kernel", "shape": [1, 1, 1024, 30], "dtype": "float32"}, {"name": "conv_23/bias", "shape": [30], "dtype": "float32"}]}, {"paths": ["group2-shard1of49", "group2-shard2of49", "group2-shard3of49", "group2-shard4of49", "group2-shard5of49", "group2-shard6of49", "group2-shard7of49", "group2-shard8of49", "group2-shard9of49", "group2-shard10of49", "group2-shard11of49", "group2-shard12of49", "group2-shard13of49", "group2-shard14of49", "group2-shard15of49", "group2-shard16of49", "group2-shard17of49", "group2-shard18of49", "group2-shard19of49", "group2-shard20of49", "group2-shard21of49", "group2-shard22of49", "group2-shard23of49", "group2-shard24of49", "group2-shard25of49", "group2-shard26of49", "group2-shard27of49", "group2-shard28of49", "group2-shard29of49", "group2-shard30of49", "group2-shard31of49", "group2-shard32of49", "group2-shard33of49", "group2-shard34of49", "group2-shard35of49", "group2-shard36of49", "group2-shard37of49", "group2-shard38of49", "group2-shard39of49", "group2-shard40of49", "group2-shard41of49", "group2-shard42of49", "group2-shard43of49", "group2-shard44of49", "group2-shard45of49", "group2-shard46of49", "group2-shard47of49", "group2-shard48of49", "group2-shard49of49"], "weights": [{"name": "conv_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "norm_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "norm_1/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "norm_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "norm_2/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "norm_3/gamma", "shape": [128], "dtype": "float32"}, {"name": "norm_3/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_4/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "norm_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "norm_4/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_5/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "norm_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "norm_5/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_6/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "norm_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "norm_6/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_7/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "norm_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "norm_7/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_8/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "norm_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "norm_8/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_9/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "norm_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "norm_9/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_10/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "norm_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "norm_10/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_11/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "norm_11/gamma", "shape": [512], "dtype": "float32"}, {"name": "norm_11/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_12/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "norm_12/gamma", "shape": [256], "dtype": "float32"}, {"name": "norm_12/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_13/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "norm_13/gamma", "shape": [512], "dtype": "float32"}, {"name": "norm_13/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_14/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "norm_14/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_14/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_15/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "norm_15/gamma", "shape": [512], "dtype": "float32"}, {"name": "norm_15/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_16/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "norm_16/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_16/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_17/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "norm_17/gamma", "shape": [512], "dtype": "float32"}, {"name": "norm_17/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_18/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "norm_18/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_18/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_19/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "norm_19/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_19/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_21/kernel", "shape": [1, 1, 512, 64], "dtype": "float32"}, {"name": "norm_21/gamma", "shape": [64], "dtype": "float32"}, {"name": "norm_21/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_20/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "norm_20/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_20/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_22/kernel", "shape": [3, 3, 1280, 1024], "dtype": "float32"}, {"name": "norm_22/gamma", "shape": [1024], "dtype": "float32"}, {"name": "norm_22/beta", "shape": [1024], "dtype": "float32"}, {"name": "norm_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "norm_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "norm_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "norm_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "norm_3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "norm_3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "norm_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "norm_4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "norm_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "norm_5/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "norm_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "norm_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "norm_7/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "norm_7/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "norm_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "norm_8/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "norm_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "norm_9/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "norm_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "norm_10/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "norm_11/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "norm_11/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "norm_12/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "norm_12/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "norm_13/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "norm_13/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "norm_14/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_14/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "norm_15/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "norm_15/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "norm_16/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_16/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "norm_17/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "norm_17/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "norm_18/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_18/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "norm_19/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_19/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "norm_21/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "norm_21/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "norm_20/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_20/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "norm_22/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "norm_22/moving_variance", "shape": [1024], "dtype": "float32"}]}]}